In [2]:
import pandas as pd

print(pd.__version__)

1.3.2

# Persiapan Data Frame

In [3]:
data = {'nama': ['acong', 'tasya', 'joko', 'jeni'],
       'jenis_kelamin': ['L', 'P', 'L', 'P'],
       'usia': [21, 23, 20, 25]}

df = pd.DataFrame(data)
df

    nama jenis_kelamin  usia
0  acong             L    21
1  tasya             P    23
2   joko             L    20
3   jeni             P    25

# Mengeluarkan Kolom Pada Data Frame

In [4]:
usia = df.pop('usia').to_frame()

In [5]:
df

    nama jenis_kelamin
0  acong             L
1  tasya             P
2   joko             L
3   jeni             P

In [6]:
usia

   usia
0    21
1    23
2    20
3    25